
Функция СведенияОВнешнейОбработке() Экспорт
	
	ОбработкаНаименование   = ЭтотОбъект.Метаданные().Имя;	
	ОбработкаВерсия 		= "3.0.0.3"; // При каждом выпуске увеличиавть значение
	лВерсияБСП		 		= "2.4.5.71";
	
	МассивФоновыхЗаданий = ФоновыеЗаданияОбработки();
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(лВерсияБСП);
	ПараметрыРегистрации.Вставить("Вид",             
		ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка());
	ПараметрыРегистрации.Вставить("Наименование",    ОбработкаНаименование);
	ПараметрыРегистрации.Вставить("Версия",          ОбработкаВерсия);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Информация",      ОбработкаНаименование);
	
	Для Каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление        = НСтр("ru = '" + ФоновоеЗадание.Название + "'");
		НоваяКоманда.Идентификатор        = ФоновоеЗадание.Ключ;
		НоваяКоманда.Использование        = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
		НоваяКоманда.ПоказыватьОповещение = Истина;
		НоваяКоманда.Модификатор          = "";
		
	КонецЦикла;
	
	ДобавитьРазрешенияКВнешнимРесурсам(ПараметрыРегистрации);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ФоновыеЗаданияОбработки()
		
	Задания = Новый Массив;
	
	// ЭПД. В конфигурации есть подсистема ЭПД
	Если Метаданные.Константы.Найти("Saby_ИспользоватьЭПД") <> Неопределено Тогда 
		Задания.Добавить(ДанныеФоновогоЗадания("Загрузка ЭПД", "Saby_Загрузка ЭПД"));            
		Задания.Добавить(ДанныеФоновогоЗадания("Выгрузка ЭПД", "Saby_Выгрузка ЭПД"));            
	КонецЕсли;
	
	Задания.Добавить(ДанныеФоновогоЗадания("Обновление статусов"));     
	Задания.Добавить(ДанныеФоновогоЗадания("Автоматические операции")); 
	
	Возврат Задания;
	
КонецФункции

Функция ДанныеФоновогоЗадания(Название, Ключ = "")
	_Ключ = Ключ;
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		_Ключ = Название;
	КонецЕсли;	
	
	Структура = Новый Структура;
	Структура.Вставить("Название", Название);
	Структура.Вставить("Ключ",     _Ключ);
	
	Возврат Структура;
КонецФункции

Функция СписокСерверовSaby(ОтображатьГОСТСервера = Истина) Экспорт
	// BSLLS:Typo-off
	// Сонар говорит - Опечатка
	МассивСерверов = Новый Массив();
	// BSLLS:Typo-on
	ДобавитьСервер(МассивСерверов, "ie-1c.saby.ru", 			"online.saby.ru");
	ДобавитьСервер(МассивСерверов, "fix-ie-1c.saby.ru", 		"fix-online.saby.ru");
	ДобавитьСервер(МассивСерверов, "test-ie-1c.saby.ru", 	"test-online.saby.ru");
	ДобавитьСервер(МассивСерверов, "pre-test-ie-1c.saby.ru", "pre-test-online.saby.ru");
    Если ОтображатьГОСТСервера Тогда
		ДобавитьСервер(МассивСерверов, "ieg-1c.sbis.ru", 	"g.sbis.ru");
		ДобавитьСервер(МассивСерверов, "fix-ieg-1c.sbis.ru", "fix-g.sbis.ru");
		ДобавитьСервер(МассивСерверов, "test-ieg-1c.sbis.ru", "test-g.sbis.ru");
	КонецЕсли;
	ДобавитьСервер(МассивСерверов, "online.sabytest.ru",         "online.sabytest.ru");
	Возврат МассивСерверов;
КонецФункции

Процедура ДобавитьСервер(СписокСерверов, Адрес, Представление, Индекс = Неопределено)
	Сервер = Новый Структура;
	Сервер.Вставить("Значение", Адрес);
	Сервер.Вставить("Представление", Представление);
	Если Индекс <> Неопределено Тогда
		СписокСерверов.Вставить(Индекс, Сервер);
	Иначе	
		СписокСерверов.Добавить(Сервер);
	КонецЕсли;		
КонецПроцедуры 

Процедура ДобавитьРазрешенияКВнешнимРесурсам(ПараметрыРегистрации)
	Порт443 = 443;
	МассивСерверов = СписокСерверовSaby();
	Для Каждого СтруктураСервера Из МассивСерверов Цикл
		Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
			"HTTPS", СтруктураСервера.Значение, Порт443, СтруктураСервера.Значение);
		ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	КонецЦикла;
КонецПроцедуры

Функция МодульКонфигурации(ИмяМодуля)
	НайденныйМодуль = Неопределено;
	Если НЕ Метаданные.ОбщиеМодули.Найти(ИмяМодуля) = Неопределено Тогда
	    НайденныйМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	КонецЕсли;
	Возврат НайденныйМодуль;
КонецФункции

Функция ВыполнитьКомандуАвтоматическиеОперации()
	Результат = Новый Структура("ИмяСобытия, Комментарий");
	СправочникДополнительныеОтчетыИОбработки = "ДополнительныеОтчетыИОбработки";
	Попытка 
		ЭтоВнешняяОбработка = Ложь;
		ИмяОбработки = "SABY";
		ИмяФайла = ПолучитьИмяВременногоФайла("epf");
		Если Метаданные.Обработки.Найти(ИмяОбработки) <> Неопределено Тогда 
			МодульОбработки = Обработки[ИмяОбработки].Создать();
		ИначеЕсли Метаданные.Справочники.Найти(СправочникДополнительныеОтчетыИОбработки) <> Неопределено 
			И ЗначениеЗаполнено(Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки))  Тогда 
			Обработка = Справочники[СправочникДополнительныеОтчетыИОбработки].НайтиПоНаименованию(ИмяОбработки);
			ДвоичныеДанные = Обработка.ХранилищеОбработки.Получить();
			// BSLLS:MissingTemporaryFileDeletion-off
			// Не видит удаления временного файла
			ДвоичныеДанные.Записать(ИмяФайла);
			// BSLLS:MissingTemporaryFileDeletion-on
			// BSLLS:UsingExternalCodeTools-off
			// Отсутствует другой способ получения внешней обработки
			ИмяТипа = "ОписаниеЗащитыОтОпасныхДействий";
            ОписаниеЗащиты = Новый(ИмяТипа);
            ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			МодульОбработки = ВнешниеОбработки.Создать(ИмяФайла, Ложь, ОписаниеЗащиты); 
			// BSLLS:UsingExternalCodeTools-on
			ИмяОбработки = ИмяФайла;
			ЭтоВнешняяОбработка = Истина;
		Иначе 
			СтрокаСообщения = Нстр("ru = 'Не удалось определить местонахождение обработки SABY!'");
			ВызватьИсключение СтрокаСообщения;
		КонецЕсли;	
		СписокФЗ = МодульОбработки.ЗапуститьАвтоматическиеОперацииФоновыеЗадания(ИмяОбработки, ЭтоВнешняяОбработка);
		ТридцатьМинут = 30;
		По60СекундВМинуте = 60;
		ФоновыеЗадания.ОжидатьЗавершения(СписокФЗ, ТридцатьМинут * По60СекундВМинуте);
		// BSLLS-off
		// Удаление происходить на сервере использовать НачатьУдалениеФайлов нельзя
		УдалитьФайлы(ИмяФайла);
		// BSLLS-on
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		Ошибка = ExtExceptionAnalyse(ИнфОбОшибке);
		ИмяСобытия	= "Ошибка выполнения регламентного задания";
		Комментарий	= ExtExceptionToMessage(Ошибка);

		Результат.Вставить("ИмяСобытия", ИмяСобытия);
		Результат.Вставить("Комментарий", Комментарий);
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Процедура ВыполнитьКоманду(Идентификатор, ПараметрыВыполненияКоманды = Неопределено) Экспорт
		
	ИмяСобытия  = "Запуск регламентного задания";
	Комментарий = "";
	
	Если СтрНайти(Идентификатор, "ЭПД", НаправлениеПоиска.СКонца) > 0 Тогда
		
		ВыполнитьРегламентноеЗаданиеЭПД(Идентификатор, ИмяСобытия, Комментарий);
		
	ИначеЕсли Идентификатор = "Обновление статусов" Тогда
		
		МодульКонфигурации = МодульКонфигурации("Saby_ФоновыеЗаданияСервер");
		Если МодульКонфигурации <> Неопределено Тогда
			Попытка
				МодульКонфигурации.АвтоматическоеОбновлениеСтатусов();
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				Ошибка = ExtExceptionAnalyse(ИнфОбОшибке);
				ИмяСобытия	= "Ошибка выполнения регламентного задания";
				Комментарий	= ExtExceptionToMessage(Ошибка);
			КонецПопытки;
		КонецЕсли;  
		
	ИначеЕсли Идентификатор = "Автоматические операции" Тогда
		РезЗапускаФЗ = ВыполнитьКомандуАвтоматическиеОперации();
		ИмяСобытия	= get_prop(РезЗапускаФЗ, "ИмяСобытия", ИмяСобытия);
		Комментарий	= get_prop(РезЗапускаФЗ, "Комментарий", Комментарий);
	Иначе	
		ИмяСобытия	= "Ошибка выполнение регламентного задания";
		Комментарий	= "Не опознанный идентификатор";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) Тогда 
		ЗаписьЖурналаРегистрации(
			"SABY " + ИмяСобытия, 
			УровеньЖурналаРегистрации.Ошибка, 
			Неопределено, 
			Идентификатор,
			Комментарий,
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРегламентноеЗаданиеЭПД(Идентификатор, ИмяСобытия, Комментарий)
	
	МодульКонфигурации = МодульКонфигурации("Saby_ТНОбщегоНазначенияСервер");		
		
	Если МодульКонфигурации <> Неопределено Тогда
		
		Попытка			
			МодульКонфигурации.ВыполнитьРегламентноеЗаданиеЭПД(Идентификатор);			
		Исключение
			
			ИнфОбОшибке = ИнформацияОбОшибке();
			Ошибка = ExtExceptionAnalyse(ИнфОбОшибке);
			ИмяСобытия	= "Ошибка выполнения регламентного задания ЭПД";
			Комментарий	= ExtExceptionToMessage(Ошибка);
			
		КонецПопытки;
		
	КонецЕсли; 
	
КонецПроцедуры

// Проверяет заполненость реквизита, если он отсутствует, используется значение по умолчанию
//
// Параметры:
//  СтруктураИсточник - Структура - в ней производим необходимые действия.
//  ИмяСвойства - Строка - Имя свойства.
//  ЗначениеПоУмолчанию - Произвольные - Значение по умолчанию.
//
// Возвращаемое значение:
//  Булево - заполнено ли указанное свойство
//
//DynamicDirective
Функция has_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Возврат ЗначениеЗаполнено(get_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию));
КонецФункции

// Возвращает значение свойства в источнике. Если нет такого - возвращается значение по умолчанию
//
// Параметры:
//  СтруктураИсточник - Структура - в ней производим необходимые действия.
//  ИмяСвойства - Строка - Имя свойства.
//  ЗначениеПоУмолчанию - Произвольный - Значение по умолчанию.
//
// Возвращаемое значение:
//  Произвольный - значение реквизита или неопределено.
//
//DynamicDirective
Функция get_prop(СтруктураИсточник, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт
    Если СтруктураИсточник = Неопределено Тогда
        Возврат ЗначениеПоУмолчанию;
    КонецЕсли;
    Значение = Неопределено;
    Результат = ЗначениеПоУмолчанию;
    Если ТипЗнч(СтруктураИсточник) = Тип("Структура") И (НЕ СтруктураИсточник.Свойство(ИмяСвойства, Значение)) Тогда
        Возврат ЗначениеПоУмолчанию;
    КонецЕсли;
    Попытка
        Значение = СтруктураИсточник[ИмяСвойства];
    Исключение
        Результат = ЗначениеПоУмолчанию;
        Значение = Неопределено;
    КонецПопытки;
    Если Значение = Неопределено Тогда
        Результат = ЗначениеПоУмолчанию;
        Значение = Неопределено;
    КонецЕсли;
    Возврат Результат;
КонецФункции

// Устанавливает значение свойства в приемнике из источника, если свойство в приемнике есть.
// Может использоваться значение по умолчанию.
//
// Параметры:
//  СтруктураИсточник - Структура - в ней производим необходимые действия.
//  СтруктураНазначения - Структура - в ней производим необходимые действия.
//  ИмяСвойстваИсточник - Строка - Имя свойства в источнике.
//  ИмяСвойстваПриемник - Строка - Имя свойства в приемнике.
//  ЗначениеПоУмолчанию - Произвольный - Значение по умолчанию.
//
//DynamicDirective
Процедура set_prop(СтруктураИсточник, СтруктураНазначения, ИмяСвойстваИсточник, ИмяСвойстваПриемник,
	ЗначениеПоУмолчанию = Неопределено) Экспорт
	ЗначениеИсточник = Get_Prop(СтруктураИсточник, ИмяСвойстваИсточник, ЗначениеПоУмолчанию);
	Если ЗначениеИсточник <> Неопределено Тогда
		СтруктураНазначения.Вставить(ИмяСвойстваПриемник, ЗначениеИсточник);
	КонецЕсли;
КонецПроцедуры

// Если не заполнено ПроверяемоеЗначение, выставляем реквизит ошибки ИмяРеквизита в значение ЗначениеРеквизита
//
// Параметры:
//  Ошибка - Структура - Ошибка.
//  ПроверяемоеЗначение - Произвольный - Проверяемое значение.
//  ИмяРеквизита - Произвольный - Имя реквизита.
//  ЗначениеРеквизита - Произвольный - Значение для незаполненного.
//
//DynamicDirective
Процедура УстановитьЗначениеОшибки(Ошибка, ПроверяемоеЗначение, ИмяРеквизита, ЗначениеРеквизита)
	Если НЕ ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда
		Ошибка[ИмяРеквизита] = ЗначениеРеквизита;
	КонецЕсли;
КонецПроцедуры

// Заполнение структуры ошибки
//
// Параметры:
//  parent - Произвольный - родитель.
//  message - Произвольный - сообщение.
//  detail - Произвольный - описание.
//  action - Произвольный - действие.
//  dump - Произвольный - дамп.
//  type - Строка - тип.
//
// Возвращаемое значение:
//  Структура - сгруппированные заполненные данные по ошибке.
//
// BSLLS:NumberOfOptionalParams-off
// Совместимость с кодом на питоне
//DynamicDirective
Функция ExtException(parent = Неопределено, message = Неопределено, detail = Неопределено, action = Неопределено,
	dump = Неопределено, type = "ExtExpception") Экспорт

	_type = type;
	Если type = Неопределено Тогда
		_type =  "ExtExpception";
	КонецЕсли;
	detailname = "detail";
	typename = "type";
	error = Новый Структура;
	error.Вставить("type", _type);
	error.Вставить("message", message);
	error.Вставить(detailname, detail);
	error.Вставить("action", action);
	error.Вставить("dump", dump);
	error.Вставить("stack", Новый Массив);
	ИмяРеквизитаMsg = "message";
	
	Если parent = Неопределено Тогда
		Возврат error;
	КонецЕсли;

	CurrentStack = Новый Структура("type, " + ИмяРеквизитаMsg + ", detail, action, dump, traceback");
	ЗаполнитьЗначенияСвойств(CurrentStack, parent);
	
	УстановитьЗначениеОшибки(error, message, ИмяРеквизитаMsg, get_prop(parent, ИмяРеквизитаMsg));
	
	Если НЕ ЗначениеЗаполнено(detail) Тогда
		Если parent.type = "Exception" И ЗначениеЗаполнено(message) Тогда
			error.detail = get_prop(parent, ИмяРеквизитаMsg) + " " + get_prop(parent, detailname);
		Иначе
			error.detail = get_prop(parent, detailname);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗначениеОшибки(error, type, typename, get_prop(parent, typename));
	Если parent.Свойство("stack") И ТипЗнч(parent.stack) = Тип("Массив") Тогда
		error.stack = parent.stack;
	КонецЕсли;
	
	УсловиеДобавленияСтека = ЗначениеЗаполнено(message) 
		ИЛИ ЗначениеЗаполнено(action) 
		ИЛИ ЗначениеЗаполнено(dump) 
		ИЛИ ЗначениеЗаполнено(detail);
	Если УсловиеДобавленияСтека	 Тогда
		error.stack.Добавить(CurrentStack);
	Иначе
		ИмяРеквизита = "dump";
		УстановитьЗначениеОшибки(error, dump, ИмяРеквизита, get_prop(parent, ИмяРеквизита));
		УстановитьЗначениеОшибки(error, action, ИмяРеквизитаMsg, get_prop(parent, ИмяРеквизитаMsg));
	КонецЕсли;
	
	Возврат error;
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Причина ошибки
//
// Параметры:
//  reason - Структура - данные с причиной ошибки.
//
// Возвращаемое значение:
//  Структура - причина ошибки
//
//DynamicDirective
Функция ExtExceptGetReason(reason)
	Если reason.Причина = Неопределено Тогда
		Возврат reason;
	Иначе
		Возврат ExtExceptGetReason(reason.Причина);
	КонецЕсли;
КонецФункции

// Данные с анализом ошибки
//
// Параметры:
//  parent - Произвольный - Родитель.
//
// Возвращаемое значение:
//  Структура - анализ ошибки
//
// BSLLS:NumberOfOptionalParams-off
// Нужны все параметры
//DynamicDirective
Функция ExtExceptionAnalyse(parent) Экспорт
	Результат = Неопределено;
	Если parent = Неопределено Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Попытка
		// Попробуем из строки получить вложеный объек
		Результат = ЗначениеИзСтрокиВнутр(parent.Описание);
	Исключение
		
		Попытка
			Причина	= ExtExceptGetReason(parent);
			message	= Причина.Описание;
			
			Результат = Новый Структура();
			Результат.Вставить("type", "Exception");
			Результат.Вставить("message", message);
			Результат.Вставить("detail");
			Результат.Вставить("action");
			Результат.Вставить("dump");
			Результат.Вставить("stack", parent.ИмяМодуля + " " + parent.НомерСтроки);
			Результат.Вставить("traceback");
		Исключение
			Результат = Новый Структура();
			Результат.Вставить("message", "Некорректный вызов исключения");
			Результат.Вставить("dump", parent);
		КонецПопытки;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Функция проброски ExtException с разбором переданного
//
// Параметры:
//  parent - Произвольный - родитель.
//  message - Произвольный - сообщение.
//  detail - Произвольный - описание.
//  action - Произвольный - действие.
//  dump - Произвольный - дамп.
//  type - Строка - тип.
//
// Возвращаемое значение:
//  Структура - сгруппированные заполненные данные по ошибке.
//
// BSLLS:NumberOfOptionalParams-off
// Нужны все параметры
//DynamicDirective
Функция NewExtExceptionСтруктура(parent = Неопределено, message = Неопределено, detail = Неопределено,
	action = Неопределено, dump = Неопределено, type = Неопределено) Экспорт
	parentStruct = ExtExceptionAnalyse(parent);
	ОшибкаСтруктура = ExtException(parentStruct, message, detail, action, dump, type);
	Возврат ОшибкаСтруктура;
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Функция проброски ExtException с разбором переданного
//
// Параметры:
//  parent - Произвольный - родитель.
//  message - Произвольный - сообщение.
//  detail - Произвольный - описание.
//  action - Произвольный - действие.
//  dump - Произвольный - дамп.
//  type - Строка - тип.
//
// Возвращаемое значение:
//  Строка - сгруппированные заполненные данные по ошибке из структуры.
//
//
// BSLLS:NumberOfOptionalParams-off
// Нужны все параметры
//DynamicDirective
Функция NewExtExceptionСтрока(parent = Неопределено, message = Неопределено, detail = Неопределено, 
	action = Неопределено, dump = Неопределено, type = Неопределено) Экспорт
	ОшибкаСтруктура = NewExtExceptionСтруктура(parent, message, detail, action, dump, type);
	Возврат ЗначениеВСтрокуВнутр(ОшибкаСтруктура);
КонецФункции
// BSLLS:NumberOfOptionalParams-on

// Получение описания ошибки
//
// Параметры:
//  error - Структура - данные по ошибке.
//
// Возвращаемое значение:
//  Строка - детали ошибки.
//
//DynamicDirective
Функция ExtExceptionToMessage(error) Экспорт
	ДеталиСообщения = get_prop(error, "detail", "");
	
	// Получим описание ошибки из структуры еррор
	Если ТипЗнч(ДеталиСообщения) = Тип("Структура") 
		Или ТипЗнч(ДеталиСообщения) = Тип("Соответствие") Тогда
        ОшибкаСообщения = get_prop(ДеталиСообщения, "error", "");
        Если ТипЗнч(ОшибкаСообщения) = Тип("Структура") 
			Или ТипЗнч(ОшибкаСообщения) = Тип("Соответствие") Тогда
            ДеталиСообщения = get_prop(ОшибкаСообщения, "message", "");
        КонецЕсли;
    КонецЕсли;
	
	// убедимся, что ДеталиСообщения - строка
	Если ТипЗнч(ДеталиСообщения) <> Тип("Строка") Тогда
		ДеталиСообщения = "";
	КонецЕсли;
	Если error.message = ДеталиСообщения Тогда
		ДеталиСообщения = "";
	КонецЕсли;
	
	Возврат error.message + " " + ДеталиСообщения;
КонецФункции

// Сохранение ошибки в журнал регистрации в виде XML
//
// Параметры:
//  ExceptionСтруктура - Структура - данные по ошибке.
//
Процедура ExtExceptionToJournal(Знач ExceptionСтруктура) Экспорт
	ИмяСобытия = ЛокализацияНазваниеПродукта() + " Ошибка " + ExceptionСтруктура.message;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ExceptionСтруктура.detail, НазначениеТипаXML.Явное);
	Комментарий = ЗаписьXML.Закрыть();
	
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ExceptionСтруктура, НазначениеТипаXML.Явное);
	Данные = ЗаписьXML.Закрыть();
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		, // ОбъектМетаданных - ссылка на элемент справичника или документ
		Данные,
		Комментарий,
    	РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
КонецПроцедуры

//DynamicDirective

Функция ЗначениеИзСтрокиВСтрокуВнутрНаСервере(Значение)  
	Возврат ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(Значение));	
КонецФункции

//DynamicDirective

Функция ЗначениеВСтрокуВнутрНаСервере(Значение)
	Возврат ЗначениеВСтрокуВнутр(Значение);
КонецФункции

// Название продукта
//
// Возвращаемое значение:
//  Строка - название продукта
//
//DynamicDirective
Функция ЛокализацияНазваниеПродукта() Экспорт
	Возврат  "SABY";
КонецФункции
