
//DynamicDirective

Процедура ПослеАвторизации() 
	ПроверитьНаличиеПИМ();
КонецПроцедуры

//DynamicDirective

Процедура ПроверитьНаличиеПИМ()
	ConnectionId = get_prop(context_params, "ConnectionUuid");
	ОбъектСинхBlockly = ПолучитьФормуBlockly(ЭтаФорма).ОбъектыСинхBlockly(context_params, ConnectionId);	
	ОбъектыИС = get_prop(ОбъектСинхBlockly, "ОбъектыИС", Новый Массив);  
	ОбъектыSaby = get_prop(ОбъектСинхBlockly, "Объекты", Новый Массив);
	Если ОбъектыИС.Количество() = 0 И ОбъектыSaby.Количество() = 0 Тогда 
		ПояснениеОповещения = "Отсутствуют программы интеграционного модуля";
		НавигационнаяСсылкаОповещения = "https://saby.ru/help/integration/1C_set";
		ПоказатьОповещениеПользователя(
			"Внимание",
			НавигационнаяСсылкаОповещения, 
			ПояснениеОповещения,
			БиблиотекаКартинок["Ошибка32"], 
			СтатусОповещенияПользователя.Важное);
	КонецЕсли;	
КонецПроцедуры
