
Функция ПриНачалеРаботы() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	ExtSysSettingsId = "ExtSysSettingsId";
	ExtSysUid = "ExtSysUid";
	НазваниеПродукта = НазваниеПродукта();
	ВерсияПродукта = ПолучитьИмяФайлаИНомерТекущейВерсии()[1];

	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ИдентификаторБазы = СокрЛП(Новый УникальныйИдентификатор);
	
	Если get_prop(ОбщиеНастройки, ExtSysUid) = Неопределено Тогда  // для перехода, удалить после версии ...
		ОбщиеНастройки.Вставить(ExtSysUid, get_prop(ОбщиеНастройки, "system_uuid", ИдентификаторБазы));
	КонецЕсли;
	Если ПустаяСтрока(get_prop(ОбщиеНастройки, ExtSysUid, "")) Тогда
		ОбщиеНастройки.Вставить(ExtSysUid, ИдентификаторБазы);
	КонецЕсли;
	
	ОбновитьНастройкиПодключенияПриНачалеРаботы();
	context_param = НастройкиПодключенияПрочитать();
	Если Не ПустаяСтрока(get_prop(context_param, "session", "")) Тогда
		Попытка
			Подключение = ПолучитьПодключение(context_param);
			ОбщиеНастройки.Вставить(ExtSysSettingsId, get_prop(Подключение, ExtSysSettingsId, ""));
			// Т.К. Ид коннекшин мог смениться, запишем параметры подключения
			context_param.Удалить(ExtSysSettingsId);
			НастройкиПодключенияЗаписать(context_param);
			ПроверитьВстраиваемыеОбъекты(context_param);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
			ExtExceptionToJournal(ОшибкаСтруктура);
		КонецПопытки;
	КонецЕсли;
	
	Если get_prop(ОбщиеНастройки, "Версия" + НазваниеПродукта) <> ВерсияПродукта Тогда
		ОбщиеНастройки = ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки);
		ОбщиеНастройки.Вставить("Версия" + НазваниеПродукта, ВерсияПродукта);
	КонецЕсли;
	Константы[ПрефиксПродукта() + "ИспользоватьКЭДО"].Установить(Истина);
	СоздатьДополнительноеСвойствоКЭДО();	
	СоздатьДополнительноеСвойствоСтатусФизЛица();
	
	// аналогично при необходимости сделать для версии конфигурации = имя параметра "ВерсияКонфигурации"
	
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбщиеНастройки;
 
КонецФункции

Функция СервисПоУмолчанию() Экспорт
	Возврат "https://online.saby.ru";
КонецФункции
