
Функция ПриНачалеРаботы() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
//	context_param = НастройкиПодключенияПрочитать();

	НазваниеПродукта = ПолучитьНазваниеПродукта();
	ВерсияПродукта = ПолучитьИмяФайлаИНомерТекущейВерсии()[1];

	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ИдентификаторБазы = СокрЛП(Новый УникальныйИдентификатор);
	
	Если get_prop(ОбщиеНастройки, "ExtSysUid") = Неопределено Тогда  // для перехода, удалить после версии ...
		ОбщиеНастройки.Вставить("ExtSysUid", get_prop(ОбщиеНастройки, "system_uuid", ИдентификаторБазы));
	КонецЕсли;
	Если ПустаяСтрока(get_prop(ОбщиеНастройки, "ExtSysUid", "")) Тогда
		ОбщиеНастройки.Вставить("ExtSysUid", ИдентификаторБазы);
	КонецЕсли;
	
	Если ПустаяСтрока(get_prop(ОбщиеНастройки, "ExtSysSettingsId", "")) Тогда
		context_param = НастройкиПодключенияПрочитать();
		Если Не ПустаяСтрока(get_prop(context_param, "session", "")) Тогда
			Попытка
				Подключение = ПолучитьПодключение(context_param);
				ОбщиеНастройки.Вставить("ExtSysSettingsId", get_prop(Подключение, "ExtSysSettingsId", ""));
				//Т.К. Ид коннекшин мог смениться, запишем параметры подключения
				context_param.Удалить("ExtSysSettingsId");
				НастройкиПодключенияЗаписать(context_param);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

	Если get_prop(ОбщиеНастройки, "Версия" + НазваниеПродукта) <> ВерсияПродукта Тогда
		ОбщиеНастройки = ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки);
		ОбщиеНастройки.Вставить("Версия" + НазваниеПродукта, ВерсияПродукта);
	КонецЕсли;
	СоздатьДополнительноеСвойствоКЭДО();	
	
	// аналогично при необходимости сделать для версии конфигурации = имя параметра "ВерсияКонфигурации"
	
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);
	Возврат ОбщиеНастройки;
 
КонецФункции

Функция ПолучитьСервисПоУмолчанию() Экспорт
	Возврат "https://ie-1c.saby.ru";
КонецФункции

