
Функция ПриПервомЗапуске(НазваниеПродукта = Неопределено, ВерсияПродукта = Неопределено) Экспорт
	ИдентификаторСистемы = СокрЛП(Новый УникальныйИдентификатор);
	_НазваниеПродукта = НазваниеПродукта;
	Если НазваниеПродукта = Неопределено Тогда
		_НазваниеПродукта = НазваниеПродукта();
	КонецЕсли;
	_ВерсияПродукта = ВерсияПродукта;
	Если ВерсияПродукта = Неопределено Тогда
		_ВерсияПродукта = ПолучитьИмяФайлаИНомерТекущейВерсии()[1];
	КонецЕсли;
	
	ОбщиеНастройки = Новый Структура();
	ОбщиеНастройки.Вставить("Версия" + _НазваниеПродукта, _ВерсияПродукта);
	ОбщиеНастройки.Вставить("ExtSysUid", ИдентификаторСистемы);

#Область include_base_ОбработчикиСобытий_ВызовПриПервомЗапускеКЭДО
#КонецОбласти
#Область include_base_ОбработчикиСобытий_ВызовПриПервомЗапускеЕТРН
#КонецОбласти
#Область include_base_ОбработчикиСобытий_ВызовПриПервомЗапускеБольничные
#КонецОбласти

	Возврат ОбщиеНастройки;
КонецФункции
