
&НаСервере
Функция ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки)
	ИнициализацияОбщихНастроекБД(ОбщиеНастройки);
	// Заполним справочник состояний объектов
	Справочники[ПрефиксПродукта() + "СостоянияОбъектов"].НачальнаяИнициализация();
	// Создадим ДопСведение - "КЭДО"
	// Проверим настройки подключения
	ПроверкаНастроекПодключенияПослеОбновления();
	// BSLLS:MissingCodeTryCatchEx-off
	УстановитьОтображениеИнформационногоОкна();
    // BSLLS:MissingCodeTryCatchEx-on
	
	ЗаписатьСтатистикуПриОбновленииМодуля(ВерсияПродукта);

	Возврат ОбщиеНастройки;
КонецФункции 

&НаСервере
Процедура УстановитьОтображениеИнформационногоОкна()
	context_params = НастройкиПодключенияПрочитать(); 
	Если context_params = Неопределено Тогда
		context_params = Новый Структура();
	КонецЕсли;
	context_params.Вставить("ОтображатьИнформационноеОкно", Истина);	
	НастройкиПодключенияЗаписать(context_params);	
КонецПроцедуры

Функция ПубличныеНастройкиПоУмолчанию() Экспорт
	ПубличныеОбщиеНастройки	= Новый Структура();
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_complete",		Истина);
	ПубличныеОбщиеНастройки.Вставить("download_attachments_on_update",			Истина);
	ПубличныеОбщиеНастройки.Вставить("refresh_statuses",						Ложь);
	ПубличныеОбщиеНастройки.Вставить("run_docflow",								Истина);
	ПубличныеОбщиеНастройки.Вставить("kedo_mark",								Ложь);
	ПубличныеОбщиеНастройки.Вставить("send_invitations",						Истина);
	ПубличныеОбщиеНастройки.Вставить("send_completed_documents",				Истина);
	ПубличныеОбщиеНастройки.Вставить("pdf_attachments",							Ложь);
	Возврат ПубличныеОбщиеНастройки;
КонецФункции

Функция ИнициализацияОбщихНастроекБД(ОбщиеНастройки)
	_ОбщиеНастройки = ОбщиеНастройки;
	Если ТипЗнч(_ОбщиеНастройки) <> Тип("Структура") Тогда
		_ОбщиеНастройки = Новый Структура();
	КонецЕсли;
	
	ПубличныеОбщиеНастройки = get_prop(_ОбщиеНастройки, "public", Новый Структура);
	ПубличныеНастройкиПоУмолчанию = ПубличныеНастройкиПоУмолчанию();
	// Обновим список настроек новыми параметрами если они появились в новой версии расширения
	// или заполним значениями по умолчанию в лучае их отсутствия у пользоваетеля
	Для Каждого КлючЗначениеПараметра Из ПубличныеНастройкиПоУмолчанию Цикл
		Если get_prop(ПубличныеОбщиеНастройки, КлючЗначениеПараметра.Ключ) = Неопределено Тогда
			ПубличныеОбщиеНастройки.Вставить(КлючЗначениеПараметра.Ключ, КлючЗначениеПараметра.Значение);
		КонецЕсли;
	КонецЦикла;
	_ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	
	// Заполним	версию расширения, для проверки обновления
	ВерсияРасширения	= "0.0.0";
	Если НЕ _ОбщиеНастройки.Свойство("ВерсияРасширения", ВерсияРасширения) Тогда
		ВерсияРасширения	= "0.0.0";
		_ОбщиеНастройки.Вставить("ВерсияРасширения", ВерсияРасширения);
	КонецЕсли;

	Возврат Истина;
КонецФункции

Процедура ПроверкаНастроекПодключенияПослеОбновления() 
	context_params = НастройкиПодключенияПрочитать(); 
	session = УИДСессии(context_params); 
	Если ПустаяСтрока(session) Тогда
		Возврат;		
	КонецЕсли;
	ОбновитьВстраиваемыеОбъекты(context_params);	
КонецПроцедуры
