
Функция ПриНачалеРаботы() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	ExtSysSettingsId = "ExtSysSettingsId";
	ExtSysUid = "ExtSysUid";
	НазваниеПродукта = НазваниеПродукта();
	ВерсияПродукта = ПолучитьИмяФайлаИНомерТекущейВерсии()[1];

	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ИдентификаторБазы = СокрЛП(Новый УникальныйИдентификатор);
	
	Если get_prop(ОбщиеНастройки, ExtSysUid) = Неопределено Тогда  // для перехода, удалить после версии ...
		ОбщиеНастройки.Вставить(ExtSysUid, get_prop(ОбщиеНастройки, "system_uuid", ИдентификаторБазы));
	КонецЕсли;
	Если ПустаяСтрока(get_prop(ОбщиеНастройки, ExtSysUid, "")) Тогда
		ОбщиеНастройки.Вставить(ExtSysUid, ИдентификаторБазы);
	КонецЕсли;
	
	Если ПустаяСтрока(get_prop(ОбщиеНастройки, ExtSysSettingsId, "")) Тогда
		context_param = НастройкиПодключенияПрочитать();
		Если Не ПустаяСтрока(get_prop(context_param, "session", "")) Тогда
			Попытка
				Подключение = ПолучитьПодключение(context_param);
				ОбщиеНастройки.Вставить(ExtSysSettingsId, get_prop(Подключение, ExtSysSettingsId, ""));
				// Т.К. Ид коннекшин мог смениться, запишем параметры подключения
				context_param.Удалить(ExtSysSettingsId);
				НастройкиПодключенияЗаписать(context_param);
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
				ExtExceptionToJournal(ОшибкаСтруктура);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	// 24.6100 TODO Удалить в 25.5ХХХ когда настройка у всех пользователей примениться
	Попытка
		ПубличныеОбщиеНастройки	= get_prop(ОбщиеНастройки, "public", Новый Структура);
		_web_interface = "web_interface";
		web_interface = get_prop(ПубличныеОбщиеНастройки, _web_interface, "1CBrowser");
		Если web_interface = "1CBrowser" Тогда
			ПубличныеОбщиеНастройки.Вставить(_web_interface,	"BrowserSaby");
		КонецЕсли;
	Исключение
		// значит ПубличныеОбщиеНастройки не структура, исправим
		ИнфОбОшибке = ИнформацияОбОшибке();
		ОшибкаСтруктура = ExtExceptionAnalyse(ИнфОбОшибке);
		ExtExceptionToJournal(ОшибкаСтруктура);
		ПубличныеОбщиеНастройки	= Новый Структура;
		ПубличныеОбщиеНастройки.Вставить(_web_interface,	"BrowserSaby");
	КонецПопытки;
	ОбщиеНастройки.Вставить("public", ПубличныеОбщиеНастройки);
	// - TODO

	Если get_prop(ОбщиеНастройки, "Версия" + НазваниеПродукта) <> ВерсияПродукта Тогда
		ОбщиеНастройки = ПриОбновленииМодуля(НазваниеПродукта, ВерсияПродукта, ОбщиеНастройки);
		ОбщиеНастройки.Вставить("Версия" + НазваниеПродукта, ВерсияПродукта);
	КонецЕсли;
	СоздатьДополнительноеСвойствоКЭДО();	
	
	// аналогично при необходимости сделать для версии конфигурации = имя параметра "ВерсияКонфигурации"
	
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);

	УстановитьПривилегированныйРежим(Ложь);

	//Удалить после 25.3100
	ИсправитьAPIURL();

	Возврат ОбщиеНастройки;
 
КонецФункции

Функция СервисПоУмолчанию() Экспорт
	Возврат "https://ie-1c.saby.ru";
КонецФункции
