
Функция ЕстьПрофилиСПравамиSaby()
	УстановитьПривилегированныйРежим(Истина);
	РольSaby	= Справочники.ИдентификаторыОбъектовРасширений.НайтиПоНаименованию("Saby_ОсновнаяРоль");
	Если РольSaby.Пустая() Тогда
		РезультатЗапроса = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПГД.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ПрофилиГруппДоступа.Роли КАК ПГД
			|ГДЕ
			|	ПГД.Роль = &РольSaby";
		Запрос.УстановитьПараметр("РольSaby", РольSaby);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить().Количество() > 0;
	КонецЕсли;
	Возврат РезультатЗапроса;
КонецФункции

