
#Область include_base_CommonModule_ИменаМодулейСервер
#КонецОбласти

#Область include_base_CommonModule_ИменаМодулейКлиент
#КонецОбласти

&Перед("ПриНачалеРаботыСистемы")
Процедура Saby_ПриНачалеРаботыСистемы(Знач ОповещениеЗавершения, НепрерывноеВыполнение)
	Если Не МодульCore().ТекущемуПользователюМожноРаботатьСРасширением() Тогда
		Возврат;
	КонецЕсли;
	
	МодульCore().ПриНачалеРаботыСистемыНаСервере();
	МодульКомандыОбменаДляФормыКлиент().ПоказатьИнформационноеОкно();
	МодульКомандыОбменаДляФормыКлиент().ЗапускПроверкиНаличияПлагина();
КонецПроцедуры
