
Функция НеобходимЗапускПереносаСтатусов() Экспорт
	Если Константы.Saby_ИспользоватьКЭДО = Ложь 
		И Константы.Saby_ИспользоватьЭЛН = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ПереносСтатусов = get_prop(ОбщиеНастройки, "ПереносСтатусов");
	СостояниеПереносаСтатусов = get_prop(ПереносСтатусов, "Состояние");  
	Если СостояниеПереносаСтатусов = "Выполнено" Тогда
		Возврат Ложь;
	КонецЕсли; 
	ДатаВремяЗапускаЗадания = get_prop(ПереносСтатусов, "ДатаВремяЗапускаЗадания", Дата(1,1,1));
	Если ДатаВремяЗапускаЗадания <> Дата(1,1,1) И  ДатаВремяЗапускаЗадания + 24 * 60 * 60 > ТекущаяДатаСеанса() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Процедура СозданиеПВХПриПереносеСтатусов()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Saby_Состояние.Сервис КАК Сервис
		|ИЗ
		|	РегистрСведений.Saby_Состояние КАК Saby_Состояние";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Префикс = ВыборкаДетальныеЗаписи.Сервис+"ДокументСБИС";
		СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_Ид"));
		СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_Статус"));
		СтатусыДокументовДобавитьЗаписьВПланВидовХарактеристик(Новый Структура("Имя", Префикс + "_ТекущийЭтап"));			
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on	
КонецПроцедуры

Функция РезультатЗапросаПереносаСтатусов()
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Saby_Состояние.Объект КАК Объект,
		|	Saby_Состояние.Сервис КАК Сервис,
		|	Saby_Состояние.Аккаунт КАК Аккаунт,
		|	Saby_Состояние.АктивныйЭтап КАК АктивныйЭтап,
		|	Saby_Состояние.Состояние КАК Состояние,
		|	Saby_Состояние.UID КАК UID,
		|	Saby_Состояние.SbisId КАК SbisId,
		|	ЕСТЬNULL(ДополнительныеСведения.Объект, NULL) КАК Объект1
		|ИЗ
		|	РегистрСведений.Saby_Состояние КАК Saby_Состояние
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО Saby_Состояние.Объект = ДополнительныеСведения.Объект
		|			И (Saby_Состояние.Сервис + ""ДокументСБИС_Ид"" = ДополнительныеСведения.Свойство.Наименование)
		|			И (Saby_Состояние.UID + ""_"" + Saby_Состояние.Аккаунт = ДополнительныеСведения.Значение 
		|					ИЛИ Saby_Состояние.UID = ДополнительныеСведения.Значение)
		|ГДЕ
		|	ДополнительныеСведения.Объект ЕСТЬ NULL"; 
	
	Если Метаданные.Документы.Найти("Saby_ЗаказНаПеревозку") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ТИПЗНАЧЕНИЯ(Saby_Состояние.Объект) <> ТИП(Документ.Saby_ЗаказНаПеревозку) ";
	КонецЕсли;	
	Если Метаданные.Документы.Найти("Saby_ПутевойЛист") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ТИПЗНАЧЕНИЯ(Saby_Состояние.Объект) <> ТИП(Документ.Saby_ПутевойЛист) ";
	КонецЕсли;	
	Если Метаданные.Документы.Найти("Saby_ТранспортнаяНакладная") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + " И ТИПЗНАЧЕНИЯ(Saby_Состояние.Объект) <> ТИП(Документ.Saby_ТранспортнаяНакладная) ";
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	Возврат РезультатЗапроса;

КонецФункции

Процедура ВыполнитьПереносСтатусов(РезультатЗапроса, ВсегоСтатусов) 

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Счетчик = 0 ;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл      
		Счетчик = Счетчик + 1;
		Прогресс = Цел(Счетчик/ВсегоСтатусов*100);
		СообщитьПрогрессОперации(Прогресс, "Перенос статусов: "+Формат(Счетчик,"ЧГ=")+ " из "+Формат(ВсегоСтатусов,"ЧГ="),Новый Структура("Прогресс, status", Прогресс, "run")); 
		Префикс = ВыборкаДетальныеЗаписи.Сервис+"ДокументСБИС";
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Аккаунт) Тогда
			УИД_Документа = СокрЛП(ВыборкаДетальныеЗаписи.UID) + "_" + СокрЛП(ВыборкаДетальныеЗаписи.Аккаунт);
		Иначе
			УИД_Документа = ВыборкаДетальныеЗаписи.UID;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Состояние = Неопределено Тогда
			СостояниеСтрокой = "";
		Иначе
			СостояниеСтрокой = СокрЛП(ВыборкаДетальныеЗаписи.Состояние);
		КонецЕсли;
		
		СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_Ид",          УИД_Документа,       					ВыборкаДетальныеЗаписи.Объект);			
		СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_Статус",      СостояниеСтрокой,    					ВыборкаДетальныеЗаписи.Объект);		
		СтатусыДокументовПоДопСведениямДобавитьСвойствоОбъекта(Префикс + "_ТекущийЭтап", ВыборкаДетальныеЗаписи.АктивныйЭтап, 	ВыборкаДетальныеЗаписи.Объект);	
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПеренестиСтатусыВТиповойРегистр(Параметры = Неопределено, АдресРезультата = Неопределено) Экспорт
	// BSLLS:SetPrivilegedMode-off
	УстановитьПривилегированныйРежим(Истина);
	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ПереносСтатусов = Новый Структура;
	ПереносСтатусов.Вставить("ДатаВремяЗапускаЗадания", ТекущаяДатаСеанса()); 
	ПереносСтатусов.Вставить("ДатаВремяОкончанияВыполнения", ""); 	
	ПереносСтатусов.Вставить("Причина", ""); 
	ОбщиеНастройки.Вставить("ПереносСтатусов", ПереносСтатусов);
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);
		
	СообщитьПрогрессОперации(0, "Получаем список статусов для переноса", Новый Структура("Прогресс, status", 0, "run"));
	РезультатЗапроса = РезультатЗапросаПереносаСтатусов();
	ВсегоСтатусов = РезультатЗапроса.Выгрузить().Количество();
	Если ВсегоСтатусов > 0 Тогда 
		Попытка
			СозданиеПВХПриПереносеСтатусов();
			СтатусыДокументовИнициализация();
			ВыполнитьПереносСтатусов(РезультатЗапроса, ВсегоСтатусов);
		Исключение
			ИнфОбОшибке = ИнформацияОбОшибке();
			detail = ExtExceptionToMessage(ИнфОбОшибке);
			data = Новый Структура("message,detail", "Перенесены не все статусы Saby", detail);
		КонецПопытки;	
		СообщитьПрогрессОперации(0, "Контрольная проверка",Новый Структура("Прогресс, status", 0, "run")); 
		РезультатЗапроса = РезультатЗапросаПереносаСтатусов();
		ВсегоСтатусов = РезультатЗапроса.Выгрузить().Количество();
	КонецЕсли;
	ОбщиеНастройки = ОбщиеНастройкиПрочитать();
	ПереносСтатусов = Новый Структура;
	ПереносСтатусов.Вставить("ДатаВремяОкончанияВыполнения", ТекущаяДатаСеанса()); 
	Если ВсегоСтатусов = 0 Тогда
		СообщитьПрогрессОперации(0, "Статусы Saby успешно перенесены", Новый Структура("Прогресс, status", 0, "complete")); 
		ПереносСтатусов.Вставить("Состояние", "Выполнено"); 
	Иначе  
		СообщитьПрогрессОперации(0, "Перенесены не все статусы Saby", Новый Структура("Прогресс, status, data", 0, "error", data)); 
		ПереносСтатусов.Вставить("Состояние", "Ошибка выполнения"); 
		ПереносСтатусов.Вставить("Причина", "Перенесены не все статусы Saby"); 
	КонецЕсли;
	ОбщиеНастройки.Вставить("ПереносСтатусов", ПереносСтатусов);
	ОбщиеНастройкиЗаписать(ОбщиеНастройки);
	УстановитьПривилегированныйРежим(Ложь);
	// BSLLS:SetPrivilegedMode-on
	
КонецПроцедуры

Функция ПолучитьТекстПереносаСтатусов() Экспорт
	Если НеобходимЗапускПереносаСтатусов() Тогда 
		// BSLLS:StyleElementConstructors-off
		ТекстСообщения = Новый Структура("Текст,ЦветТекста", "Выполните перенос статусов " + ЛокализацияНазваниеПродукта(), Новый Цвет(255,0,0));
		// BSLLS:StyleElementConstructors-on 
		ССылкаПодробнее = Новый Структура;
		ССылкаПодробнее.Вставить("Текст", "Подробнее");
		ССылкаПодробнее.Вставить("Ссылка", "https://online.sbis.ru/news/8226671f-03fb-437a-9b8a-c5054b3bf548");
		ДействиеЗапустить = Новый Структура;
		ДействиеЗапустить.Вставить("Текст", "Запустить перенос");
		ДействиеЗапустить.Вставить("Действие", "ПереносСтатусовSaby");
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("ТекстСообщения", ТекстСообщения);
   		СтруктураСообщения.Вставить("ССылкаПодробнее", ССылкаПодробнее);
    	СтруктураСообщения.Вставить("ДействиеЗапустить", ДействиеЗапустить);
		Возврат СтруктураСообщения;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
