
Процедура ВывестиТекстСообщения(СтруктураСообщения) 
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ТекстСообщения = Неопределено;
	Если СтруктураСообщения.Свойство("ТекстСообщения", ТекстСообщения) = Ложь Тогда 
		Возврат;	
	КонецЕсли;
	ЭлементФормочкиТекстСообщения = ЭлементыФормочки.Найти("ТекстСообщения"); 
	Если ЭлементФормочкиТекстСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементФормочкиТекстСообщения.Заголовок = get_prop(ТекстСообщения, "Текст", "");
	// BSLLS:StyleElementConstructors-off
	ЭлементФормочкиТекстСообщения.Шрифт = get_prop(ТекстСообщения, "Шрифт", Новый Шрифт);
	// BSLLS:StyleElementConstructors-on
	ЭлементФормочкиТекстСообщения.ЦветТекста = get_prop(ТекстСообщения, "ЦветТекста", ЭлементФормочкиТекстСообщения.ЦветТекста);
КонецПроцедуры

Процедура ВывестиСсылкаПодробнее(СтруктураСообщения)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	СсылкаПодробнее = Неопределено;
	Если СтруктураСообщения.Свойство("СсылкаПодробнее", СсылкаПодробнее) = Ложь Тогда 
		Возврат;	
	КонецЕсли;
	ЭлементФормочкиСсылкаПодробнее = ЭлементыФормочки.Найти("СсылкаПодробнее"); 
	Если ЭлементФормочкиСсылкаПодробнее = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементФормочкиСсылкаПодробнее.Заголовок = get_prop(СсылкаПодробнее, "Текст", "");
	// BSLLS:StyleElementConstructors-off
	ЭлементФормочкиСсылкаПодробнее.Шрифт = get_prop(СсылкаПодробнее, "Шрифт", Новый Шрифт);
	// BSLLS:StyleElementConstructors-on
	ЭлементФормочкиСсылкаПодробнее.ЦветТекста = get_prop(СсылкаПодробнее, "ЦветТекста", ЭлементФормочкиСсылкаПодробнее.ЦветТекста);
	ЭтаФорма.ГиперСсылкаПодробнее = get_prop(СсылкаПодробнее, "Ссылка", "");		
КонецПроцедуры

Процедура ВывестиДействиеЗапустить(СтруктураСообщения)
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ДействиеЗапустить = Неопределено;
	Если СтруктураСообщения.Свойство("ДействиеЗапустить", ДействиеЗапустить) = Ложь Тогда 
		Возврат;	
	КонецЕсли;
	ЭлементФормочкиЗапуститьПроцесс = ЭлементыФормочки.Найти("ЗапуститьПроцесс"); 
	Если ЭлементФормочкиЗапуститьПроцесс = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементФормочкиЗапуститьПроцесс.Заголовок = get_prop(ДействиеЗапустить, "Текст", "");
	// BSLLS:StyleElementConstructors-off
	ЭлементФормочкиЗапуститьПроцесс.Шрифт = get_prop(ДействиеЗапустить, "Шрифт", Новый Шрифт);
	// BSLLS:StyleElementConstructors-on
	ЭлементФормочкиЗапуститьПроцесс.ЦветТекста = get_prop(ДействиеЗапустить, "ЦветТекста", ЭлементФормочкиЗапуститьПроцесс.ЦветТекста);
	ЭлементФормочкиЗапуститьПроцесс.УстановитьДействие("Нажатие", get_prop(ДействиеЗапустить, "Действие", ""));	
КонецПроцедуры

Процедура ПоказатьТекстСообщения() 
	МодульОбъекта = МодульОбъекта();
	СтруктураСообщения = МодульОбъекта.ПолучитьТекстПереносаСтатусов();
	ЭлементыФормочки = ПолучитьЭлементыФормыНаСервере();
	ЭлементыФормочки.ГруппаСообщений.Видимость = Ложь;;
	Если СтруктураСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;   
	ЭлементыФормочки.ГруппаСообщений.Видимость = Истина;;
	
	ВывестиТекстСообщения(СтруктураСообщения);
	ВывестиСсылкаПодробнее(СтруктураСообщения);
	ВывестиДействиеЗапустить(СтруктураСообщения);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПодробнееНажатие(Элемент)
	Если ЗначениеЗаполнено(ЭтаФорма.ГиперСсылкаПодробнее) Тогда
		// BSLLS:UsingSynchronousCalls-off
		ЗапуститьПриложение(ЭтаФорма.ГиперСсылкаПодробнее);
		// BSLLS:UsingSynchronousCalls-on
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПереносСтатусовSaby(Элемент)
	МодульФоновогоЗаданияКлиент().ПереносСтатусовSABY();	
КонецПроцедуры
